<template>
    <div class="q-pa-md items-start q-gutter-md">
        <div>
            <div class="text-left text-h4" style="font-weight: bold;">ジャンプ主人公と心理的本質主義の考察</div>
            <div class="text-subtitle2">2023/02/18 更新</div>
        </div>
        <q-img src="../assets/picturesForBlogs/weekly-jump.jpg" class="top_img"></q-img>
        <div class="text-subtitle2 text-right">「週刊少年ジャンプ」と検索して最初に出てきた画像。(引用:https://www.shonenjump.com/j/)</div>
        <div class="text-left text-h5" style="font-weight: bold; margin-top: 30px;">「週刊少年ジャンプ」とは</div>
        <div>
            <p style="font-size: 1rem; line-height: 180%;">
                よくある下らないアフィリエイトサイトのように、「週刊少年ジャンプ」についてバカ丁寧に説明してもいいのだが、
                あまりにもわざとらしいのでここでは特に説明はしない。<br>
                <br>
                ただ、少し調べていて初めて分かったのだが、週刊少年ジャンプのテーマ乃至キーワードは
                「友情・努力・勝利」だそうだ（出典:<a href="https://ja.wikipedia.org/wiki/%E9%80%B1%E5%88%8A%E5%B0%91%E5%B9%B4%E3%82%B8%E3%83%A3%E3%83%B3%E3%83%97">Wikipedia</a>）。<br>
                昔はこのいずれかのテーマを含んだ作品であることが編集の方針だったらしい。これは後々重要になってくる気がするので簡潔に記しておく。
            </p>
        </div>
        <div class="text-left text-h5" style="font-weight: bold; margin-top: 30px;">心理的本質主義とは</div>
        <div>
            <p style="font-size: 1rem; line-height: 180%;">
                さて、諸君らが気になるのは、こちらについてだろう。私が心理学を専攻していることを知っている人は多いかもしれないが、
                果たしてどんなことを研究しているのか、ピンと来る人は少ないだろう。<br>
                少し自己紹介をすると、現在私は心理学の中でも社会心理学という分野を研究していて、社会心理学は特に人間の心理の中でも人対人の関係性
                に着目した領域である。その中でも特に私は道徳に関する研究を専門にしており、それゆえ今回の話題は(自分で取り上げておいてアレなのだが)
                少々私の専門分野とはズレる。<br>
                <br>
                それでは、本題に入っていきたい。心理的本質主義とは何か。おそらく私が説明するよりも、
                <a href="https://psych.or.jp/publication/world090/pw06/">こちら</a>のサイトから引用した方が分かりやすいだろう。
            </p>
            <blockquote>
                <p>ある人が「その人」であるのは，「その人」が生まれながらに持っている本質のせいだという考え方を心理的本質主義と呼ぶ。
                    特に，社会的カテゴリーの認知において，この心理的本質主義の考え方は適用されやすい。
                    例えば，「女性は遺伝的に家事に向いている」とか，
                    「あの人は外国育ちだけれど，日本人の血を引いているから奥ゆかしい」などといった言及がみられるなら，
                    その発言者は「女性」や「日本人」といった社会的カテゴリーの認知に心理的本質主義を適用しているということになる。
                </p>
            </blockquote>
            <blockquote>
                <p>ここまで，心理的本質主義の特徴について述べたが，本質の実体は具体的に定義できなくてもよいとされている。
                    「本質」は自然で，生得的で，分類可能で，表面化していない「何か」であれば，実は何であってもよいのである（Medin & Ortony, 1989）。
                    日常場面では，本質の「仮の姿」としてDNAや血などの人の資質が比喩的に用いられる。
                </p>
            </blockquote>
            <p style="font-size: 1rem; line-height: 180%;">
                非常に分かりやすい説明だ。まだピンと来ていない人にもう少し説明すると、
                例えば、両親が学校教師の家庭の子供が実際に学校教師になっていたら、「なるほど、この子は両親の血を引いたんだな」などと素朴に思うことがあると思う。
                この場合、子供が学校教師になったのは両親の「血統」に「本質」があると考えていることになる。<br>
                こういった思考の傾向が心理的本質主義と呼ばれており、もちろん、こういった風に考える傾向が強い人もいれば、そうでない人もいる。
                なんにせよ、用語自体は小難しいが、概念自体は理解しやすいものではないだろうか。<br>
                <br>

            </p>  
            <div class="text-left text-h5" style="font-weight: bold; margin-top: 30px;">「友情・努力・勝利」</div>
            <div>
                <p style="font-size: 1rem; line-height: 180%;">
                    <br>
                    では、これが諸君らお馴染みの週刊少年ジャンプとどう関係があるのか。諸君らの中に『DEATH NOTE』の夜神月のように頭がグンバツに切れる読者がいれば、
                    なんとなく察してきたのではないだろうか。<br>
                    冒頭でも述べたように、少年ジャンプのテーマは「友情・努力・勝利」だ。特に重要なのは3つ目の「勝利」だろう。
                    毎度毎度敵に負けてばかりの主人公では、読者に呆れられてしまう。読者が喜ぶのは、やはり自分が応援している主人公サイドが勝ったときだろう。<br>
                    まぁ、ここまではよいだろう。<br>
                    <br>
                    問題は、<strong>勝つためには「勝った理由」が必要</strong>なのだ。<br>
                    <br>
                    「相手よりも力が強い」「相手よりも頭がいい」「腕が伸びる」「未来が視える」「時間を止められる」...。よくもまあ、漫画家も思いつくもんだ。
                    あの手この手で主人公(あるいは味方)は敵に勝たなければならない。<br>
                    でも読者もバカではない。次にはこういった意見が出てくるはずだ。<br>
                    <br>
                    じゃあ、なんで相手よりも強いの？<br>
                    なんで相手よりも頭がいいの？<br>
                    なんでそんな能力を持っているの？<br>
                    <br>
                    ここで登場するのが他ならない、「本質」だ。<br>
                    先ほど登場した週刊少年ジャンプの3つのテーマのうちの残り二つ、「友情」と「努力」はこれに該当するであろう。
                    特に「友情」と「努力」を体現する作品と言えば、80年代であれば『ジョジョの奇妙な冒険 第二部』や近年であれば『僕のヒーローアカデミア』などではないだろうか。<br>
                </p>
            </div>
            <div class="responsive_flex">
                <q-img src="../assets/picturesForBlogs/jojo_part2.jpg" class="insert_img"></q-img>
                <q-img src="../assets/picturesForBlogs/myheroacademia.jpg" class="insert_img"></q-img>
            </div>
            <div class="text-subtitle2 text-right">
                (引用:https://renote.net/articles/10101, https://prtimes.jp/main/html/rd/p/000000298.000023394.html)
            </div>
            <div class="text-left text-h5" style="font-weight: bold; margin-top: 30px;">20世紀の「血統」</div>
            <div>
                <p style="font-size: 1rem; line-height: 180%;">
                    <br>
                    私の主観として、1980～90年代のジャンプ主人公の強さは「血統」に依存していたように思える。<br>
                    つまり、「この主人公が強いのは、父親が世界最強の○○だったから」だとか「この主人公は○○という種族だから強い」
                    という説明が多くなされていたように思える。<br>
                    ここからは、特に物語冒頭時点での主人公の強さを説明していたのが「血統」である例を、いくつかの漫画を取り上げながら紹介したい。<br>
                    <br>
                    ジャンプファンで「血統」と聞いてまず思い浮かぶのは、先ほども登場した『ジョジョの奇妙な冒険』だろう。
                    先ほどは、第二部が「友情」と「努力」による「勝利」であることを紹介したが、
                    主人公ジョセフ・ジョースターはラスボスに挑むにあたって「努力」と呼ばれるようなものは1ヶ月しかしていないことが作中で説明されている。<br>
                    そもそも1ヶ月の修行で済んだのも、ジョセフが祖父ジョナサンの「血統」を受け継いでいて才能があったからである。<br>
                    第三部主人公の空条承太郎に至っては「ジョースター家の血を引き継いでいる」
                    という以外の明確な理由もなく作中最強の「幽波紋(スタンド)」を身に着けている。<br>
                    <br>
                    もう一つ代表的な例として挙げられるのが、『ドラゴンボール』であろう。<br>
                    主人公孫悟空は、諸君らもご存知の通りサイヤ人という宇宙人だ。熱烈なファンであれば「悟空がサイヤ人だと明かされたのは、かなり後だ」
                    とツッコミを入れたくなるかもしれないが、一旦矛を収めて欲しい。<br>
                    確かに、物語の序盤において孫悟空はサイヤ人だという説明はされていなかったが、尻尾が生えていて、
                    満月の夜に大猿になって暴れている。これは明らかにブルマやヤムチャ、そしてその他の「人間」とは特徴が異なる。<br>
                    当時の読者は心のどこかで、孫悟空が人間離れした強さであるのは「人間ではない」からだと分かっていたはずだ。
                    (もしくは、人間ではないと明言されていたかもしれないが、読んだのが昔過ぎて忘れてしまった...。)<br>
                    <br>
                    他にも、父親が世界最強のハンターであったためにハンターの適正が自分にもあった『ハンターハンター』のゴン=フリークス、
                    代々シャーマンの家系である麻倉葉が主人公の『シャーマンキング』、『ダイの大冒険』のダイも父親が重要人物である。<br>
                    <br>
                    これまで紹介したように、1980～90年代のジャンプ主人公の強いのは「血統」ゆえ「特別」であるという説明は、
                    少なくともこの後紹介する現代に比べて多かったように感じる。もちろん、『北斗の拳』・『聖闘士星矢』・『幽☆遊☆白書』・『遊☆戯☆王』のように主人公が血縁関係ゆえの強さを会得していない作品、
                    あるいはむしろこの後紹介する法則に近い作品も多々存在することを理解している。<br>
                    <br>
                    あくまでここで主張したいのは、<strong>現在と比べて</strong>心理的本質主義的な観点からの主人公の強さを説明している作品が多かった、
                    少なくとも私はそう感じる、ということだ。
                </p>
            </div>
            <q-img src="../assets/picturesForBlogs/jump_goldenage.jpg" class="top_img"></q-img>
            <div class="text-subtitle2 text-right">黄金期と呼ばれるころの週刊少年ジャンプ。(引用:https://charalab.com/21023/)</div>
            <div class="text-left text-h5" style="font-weight: bold; margin-top: 30px;">21世紀の「偶然」</div>
            <div>
                <p style="font-size: 1rem; line-height: 180%;">
                    <br>
                </p>
            </div>
        </div>
    </div>
</template>
<script setup lang="ts">

</script>
<style scoped>
.top_img{
    height: 200px;
    margin-left: 10px;
}

blockquote {
    margin: 0;
}

blockquote p {
    padding: 15px;
    background: #eee;
    border-radius: 5px;
}

strong{
    font-weight: bold
}

.responsive_flex{
    display: flex;
}

.insert_img{
    height: 200px;
    margin-left: 10px;
}

@media screen and (max-width: 1024px){
  div.responsive_flex{
    display: block;
  }
  .insert_img{
    margin-bottom: 10px;
}
}


</style>